-- phpMyAdmin SQL Dump
-- version 3.5.1
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1
-- Время создания: Окт 09 2014 г., 02:16
-- Версия сервера: 5.5.25
-- Версия PHP: 5.2.12

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `db`
--

-- --------------------------------------------------------

--
-- Структура таблицы `exchange`
--

CREATE TABLE IF NOT EXISTS `exchange` (
  `Id` int(5) NOT NULL AUTO_INCREMENT,
  `Vid` varchar(4) NOT NULL,
  `Date` date NOT NULL,
  `Valyuta` text NOT NULL,
  `SumVal` int(10) NOT NULL,
  `SumGrn` varchar(10) NOT NULL,
  `Kor` varchar(8) NOT NULL,
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=23 ;

--
-- Дамп данных таблицы `exchange`
--

INSERT INTO `exchange` (`Id`, `Vid`, `Date`, `Valyuta`, `SumVal`, `SumGrn`, `Kor`) VALUES
(1, 'buy', '2014-10-01', 'USD', 350, '4480.00', 'АА222555'),
(2, 'sale', '2014-10-01', 'RUB', 1000, '340.00', 'ЕЕ123321'),
(3, 'sale', '2014-10-01', 'EUR', 500, '8600.00', 'АК218218'),
(4, 'sale', '2014-10-02', 'EUR', 100, '1740.00', 'АК123456'),
(5, 'buy', '2014-10-02', 'RUB', 1000, '320.00', 'АВ789987'),
(6, 'buy', '2014-10-02', 'USD', 250, '3214.00', 'НН111222'),
(7, 'buy', '2014-10-03', 'RUB', 1000, '315.00', 'АК123456'),
(8, 'buy', '2014-10-03', 'USD', 100, '1285.00', 'АА111222'),
(9, 'sale', '2014-10-04', 'EUR', 450, '7852.50', 'АА111333'),
(10, 'buy', '2014-10-04', 'USD', 1000, '12880.00', 'АА111222'),
(11, 'buy', '2014-10-04', 'USD', 1500, '19320.00', 'НН753951'),
(12, 'sale', '2014-10-04', 'RUB', 10000, '3800.00', 'ЕЕ455655'),
(13, 'sale', '2014-10-04', 'EUR', 1200, '20940.00', 'ОО555666'),
(14, 'sale', '2014-10-05', 'USD', 150, '1950.00', 'АА122344'),
(15, 'buy', '2014-10-06', 'EUR', 130, '2151.50', 'АА222555'),
(16, 'sale', '2014-10-06', 'RUB', 5000, '1900.00', 'АК123456'),
(17, 'sale', '2014-10-07', 'USD', 250, '3262.50', 'АА258852'),
(18, 'sale', '2014-10-07', 'EUR', 120, '2095.20', 'АА258258'),
(19, 'buy', '2014-10-07', 'EUR', 100, '1651.00', 'НН147741'),
(20, 'buy', '2014-10-07', 'RUB', 1000, '335.00', 'КК777888'),
(21, 'buy', '2014-10-08', 'EUR', 100, '1640.00', 'АА222555'),
(22, 'sale', '2014-10-09', 'EUR', 100, '1755.00', 'КК888999');

-- --------------------------------------------------------

--
-- Структура таблицы `kor`
--

CREATE TABLE IF NOT EXISTS `kor` (
  `Fam` varchar(20) NOT NULL,
  `Name` varchar(20) NOT NULL,
  `Otch` varchar(20) NOT NULL,
  `Pasport` varchar(8) NOT NULL,
  UNIQUE KEY `Pasport` (`Pasport`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `kor`
--

INSERT INTO `kor` (`Fam`, `Name`, `Otch`, `Pasport`) VALUES
('Коваленко', 'Григорий', 'Николаевич', 'АА111222'),
('Гришковец', 'Степан', 'Васильевич', 'АА111333'),
('Антонова', 'Елена', 'Алексеевна', 'АА122344'),
('Зелинская', 'Ольга', 'Николаевна', 'АА222555'),
('Иванова', 'Ольга', 'Павловна', 'АА258258'),
('Романюк', 'Оксана', 'Петровна', 'АА258852'),
('Нечепочук', 'Иван', 'Сегеевич', 'АВ789987'),
('Гончаров', 'Андрей', 'Витальевич', 'АК123456'),
('Дятлова', 'Елена', 'Михайловна', 'АК218218'),
('Иванов', 'Степан', 'Юрьевич', 'ЕЕ123321'),
('Григорюк', 'Иван', 'Иванович', 'ЕЕ455655'),
('Гриценко', 'Жанна', 'Ивановна', 'КК777888'),
('Степанов', 'Александр', 'Степанович', 'КК888999'),
('Петров', 'Павел', 'Петрович', 'НН111222'),
('Рыжков', 'Евгений', 'Алексеевич', 'НН147741'),
('Ткаченко', 'Светлана', 'Леонидовна', 'НН753951'),
('Лазарев', 'Василий', 'Леонидович', 'ОО555666');

-- --------------------------------------------------------

--
-- Структура таблицы `kurs`
--

CREATE TABLE IF NOT EXISTS `kurs` (
  `Date` date NOT NULL,
  `Valyuta` varchar(3) NOT NULL,
  `Buy` varchar(10) NOT NULL,
  `Sale` varchar(10) NOT NULL,
  `id` int(11) NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=31 ;

--
-- Дамп данных таблицы `kurs`
--

INSERT INTO `kurs` (`Date`, `Valyuta`, `Buy`, `Sale`, `id`) VALUES
('2014-10-01', 'USD', '12.800', '12.920', 1),
('2014-10-01', 'EUR', '16.350', '17.200', 2),
('2014-10-01', 'RUB', '0.310', '0.340', 3),
('2014-10-02', 'USD', '12.855', '12.960', 4),
('2014-10-02', 'EUR', '16.450', '17.400', 5),
('2014-10-02', 'RUB', '0.320', '0.355', 6),
('2014-10-03', 'USD', '12.850', '12.980', 10),
('2014-10-03', 'EUR', '16.450', '17.380', 11),
('2014-10-03', 'RUB', '0.315', '0.345', 12),
('2014-10-04', 'USD', '12.880', '13.010', 13),
('2014-10-04', 'EUR', '16.490', '17.450', 14),
('2014-10-04', 'RUB', '0.325', '0.380', 15),
('2014-10-05', 'USD', '12.930', '13.000', 16),
('2014-10-05', 'EUR', '16.460', '17.380', 17),
('2014-10-05', 'RUB', '0.330', '0.390', 18),
('2014-10-06', 'USD', '13.010', '13.300', 19),
('2014-10-06', 'EUR', '16.550', '17.480', 20),
('2014-10-06', 'RUB', '0.333', '0.380', 21),
('2014-10-07', 'USD', '12.990', '13.050', 22),
('2014-10-07', 'EUR', '16.510', '17.460', 23),
('2014-10-07', 'RUB', '0.335', '0.385', 24),
('2014-10-08', 'USD', '12.990', '13.100', 25),
('2014-10-08', 'EUR', '16.400', '17.450', 26),
('2014-10-08', 'RUB', '0.320', '0.380', 27),
('2014-10-09', 'USD', '13.050', '13.200', 28),
('2014-10-09', 'EUR', '16.500', '17.550', 29),
('2014-10-09', 'RUB', '0.330', '0.375', 30);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
